In [1]:
import pandas as pd
import numpy as np

In [2]:
%pwd

'C:\\Users\\tmznq\\workspace\\ml_scratch\\seoul_coding_academy\\study'

In [4]:
# error : Install xlrd >= 1.0.0 for Excel support 이거 깔으랍니다.
# !pip install xlrd

In [5]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'
data = pd.read_excel(path)
data

    id  class  math  english  science
0    1      1    50       98       50
1    2      1    60       97       60
2    3      1    45       86       78
3    4      1    30       98       58
4    5      2    25       80       65
5    6      2    50       89       98
6    7      2    80       90       45
7    8      2    90       78       25
8    9      3    20       98       15
9   10      3    50       98       45
10  11      3    65       65       65
11  12      3    45       85       32
12  13      4    46       98       65
13  14      4    48       87       12
14  15      4    75       56       78
15  16      4    58       98       65
16  17      5    65       68       98
17  18      5    80       78       90
18  19      5    89       68       87
19  20      5    78       83       58

#### 문제 정의
- 반별 과목별 평균을 구하고, 반별 평균보다 높은 학생 id를 출력하라.

In [8]:
# class와 id에 따른 pivoting
df = data.pivot_table(index=['class', 'id'])
df

          english  math  science
class id
1     1        98    50       50
      2        97    60       60
      3        86    45       78
      4        98    30       58
2     5        80    25       65
      6        89    50       98
      7        90    80       45
      8        78    90       25
3     9        98    20       15
      10       98    50       45
      11       65    65       65
      12       85    45       32
4     13       98    46       65
      14       87    48       12
      15       56    75       78
      16       98    58       65
5     17       68    65       98
      18       78    80       90
      19       68    89       87
      20       83    78       58

In [20]:
# 반 별 grouping
df2 = df.groupby(level = 0)
df2

In [21]:
for i in df2:
    print(i)

(1,           english  math  science
class id
1     1        98    50       50
      2        97    60       60
      3        86    45       78
      4        98    30       58)
(2,           english  math  science
class id
2     5        80    25       65
      6        89    50       98
      7        90    80       45
      8        78    90       25)
(3,           english  math  science
class id
3     9        98    20       15
      10       98    50       45
      11       65    65       65
      12       85    45       32)
(4,           english  math  science
class id
4     13       98    46       65
      14       87    48       12
      15       56    75       78
      16       98    58       65)
(5,           english  math  science
class id
5     17       68    65       98
      18       78    80       90
      19       68    89       87
      20       83    78       58)

In [33]:
# groupby 추출하기
df_group = pd.DataFrame(df2.apply(lambda x: x))
df_group

          english  math  science
class id
1     1        98    50       50
      2        97    60       60
      3        86    45       78
      4        98    30       58
2     5        80    25       65
      6        89    50       98
      7        90    80       45
      8        78    90       25
3     9        98    20       15
      10       98    50       45
      11       65    65       65
      12       85    45       32
4     13       98    46       65
      14       87    48       12
      15       56    75       78
      16       98    58       65
5     17       68    65       98
      18       78    80       90
      19       68    89       87
      20       83    78       58

In [40]:
# groupby 추출하기
df_group2 = pd.DataFrame(df2.apply(lambda x: x.iloc[1:3]))
df_group2

                english  math  science
class class id
1     1     2        97    60       60
            3        86    45       78
2     2     6        89    50       98
            7        90    80       45
3     3     10       98    50       45
            11       65    65       65
4     4     14       87    48       12
            15       56    75       78
5     5     18       78    80       90
            19       68    89       87

In [38]:
df2.mean()

       english   math  science
class
1        94.75  46.25    61.50
2        84.25  61.25    58.25
3        86.50  45.00    39.25
4        84.75  56.75    55.00
5        74.25  78.00    83.25

In [48]:
result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()]))
result

          english  math  science
class id
1     1      98.0  50.0      NaN
      2      97.0  60.0      NaN
      3       NaN   NaN     78.0
      4      98.0   NaN      NaN
2     5       NaN   NaN     65.0
      6      89.0   NaN     98.0
      7      90.0  80.0      NaN
      8       NaN  90.0      NaN
3     9      98.0   NaN      NaN
      10     98.0  50.0     45.0
      11      NaN  65.0     65.0
      12      NaN   NaN      NaN
4     13     98.0   NaN     65.0
      14     87.0   NaN      NaN
      15      NaN  75.0     78.0
      16     98.0  58.0     65.0
5     17      NaN   NaN     98.0
      18     78.0  80.0     90.0
      19      NaN  89.0     87.0
      20     83.0   NaN      NaN

In [25]:
result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()])) # x[x > x.mean()] : fancy indexing
result

          english  math  science
class id
1     1      98.0  50.0      NaN
      2      97.0  60.0      NaN
      3       NaN   NaN     78.0
      4      98.0   NaN      NaN
2     5       NaN   NaN     65.0
      6      89.0   NaN     98.0
      7      90.0  80.0      NaN
      8       NaN  90.0      NaN
3     9      98.0   NaN      NaN
      10     98.0  50.0     45.0
      11      NaN  65.0     65.0
      12      NaN   NaN      NaN
4     13     98.0   NaN     65.0
      14     87.0   NaN      NaN
      15      NaN  75.0     78.0
      16     98.0  58.0     65.0
5     17      NaN   NaN     98.0
      18     78.0  80.0     90.0
      19      NaN  89.0     87.0
      20     83.0   NaN      NaN

In [49]:
result[['english']].dropna()

          english
class id
1     1      98.0
      2      97.0
      4      98.0
2     6      89.0
      7      90.0
3     9      98.0
      10     98.0
4     13     98.0
      14     87.0
      16     98.0
5     18     78.0
      20     83.0

In [58]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def id_2(path, subject = ''):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()])) # apply에 함수 적용
    
    return result[['{}'.format(subject)]].dropna()

In [59]:
id_2(path, subject = 'math')

          math
class id
1     1   50.0
      2   60.0
2     7   80.0
      8   90.0
3     10  50.0
      11  65.0
4     15  75.0
      16  58.0
5     18  80.0
      19  89.0

In [52]:
df2

In [55]:
df2.rank(method='first')

          english  math  science
class id
1     1       3.0   3.0      1.0
      2       2.0   4.0      3.0
      3       1.0   2.0      4.0
      4       4.0   1.0      2.0
2     5       2.0   1.0      3.0
      6       3.0   2.0      4.0
      7       4.0   3.0      2.0
      8       1.0   4.0      1.0
3     9       3.0   1.0      1.0
      10      4.0   3.0      3.0
      11      1.0   4.0      4.0
      12      2.0   2.0      2.0
4     13      3.0   1.0      2.0
      14      2.0   2.0      1.0
      15      1.0   4.0      4.0
      16      4.0   3.0      3.0
5     17      1.0   1.0      4.0
      18      3.0   3.0      3.0
      19      2.0   4.0      2.0
      20      4.0   2.0      1.0

In [24]:
df2.mean()

       english   math  science
class
1        94.75  46.25    61.50
2        84.25  61.25    58.25
3        86.50  45.00    39.25
4        84.75  56.75    55.00
5        74.25  78.00    83.25

In [60]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def all(path):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()]).fillna(value = '평균미달'))
    return result

In [61]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def _rank(path):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()].rank(method = 'first', ascending = False)).fillna(value = '평균미달'))
    return result

In [62]:
all(path)[:4]

         english  math science
class id
1     1       98    50    평균미달
      2       97    60    평균미달
      3     평균미달  평균미달      78
      4       98  평균미달    평균미달

In [63]:
_rank(path)

         english  math science
class id
1     1        1     2    평균미달
      2        3     1    평균미달
      3     평균미달  평균미달       1
      4        2  평균미달    평균미달
2     5     평균미달  평균미달       2
      6        2  평균미달       1
      7        1     2    평균미달
      8     평균미달     1    평균미달
3     9        1  평균미달    평균미달
      10       2     2       2
      11    평균미달     1       1
      12    평균미달  평균미달    평균미달
4     13       1  평균미달       2
      14       3  평균미달    평균미달
      15    평균미달     1       1
      16       2     2       3
5     17    평균미달  평균미달       1
      18       2     2       2
      19    평균미달     1       3
      20       1  평균미달    평균미달

___

In [200]:
# cf) class별 평균으로 정렬해보기.
result2 = pd.DataFrame(df2.apply(lambda x: x.sort_values(ascending=False)))
result2.head()

               mean
class id
1     2   72.333333
      3   69.666667
      1   66.000000
      4   62.000000
2     6   79.000000